ycsb_run_t100_r10_i90.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 248575.0
[OVERALL], Throughput(ops/sec), 40229.307050186064
[TOTAL_GCS_PS_Scavenge], Count, 204.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 992.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3990747259378457
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 204.0
[TOTAL_GC_TIME], Time(ms), 992.0
[TOTAL_GC_TIME_%], Time(%), 0.3990747259378457
[READ-FAILED], Operations, 1.0
[READ-FAILED], AverageLatency(us), 2229.0
[READ-FAILED], MinLatency(us), 2228.0
[READ-FAILED], MaxLatency(us), 2229.0
[READ-FAILED], 95thPercentileLatency(us), 2229.0
[READ-FAILED], 99thPercentileLatency(us), 2229.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 54.94
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 5327.0
[CLEANUP], 95thPercentileLatency(us), 2.0
[CLEANUP], 99thPercentileLatency(us), 14.0
[INSERT], Operations, 8999762.0
[INSERT], AverageLatency(us), 54.32783133598422
[INSERT], MinLatency(us), 15.0
[INSERT], MaxLatency(us), 131967.0
[INSERT], 95thPercentileLatency(us), 52.0
[INSERT], 99thPercentileLatency(us), 192.0
[INSERT], Return=OK, 8999762
[READ], Operations, 1000237.0
[READ], AverageLatency(us), 24059.437908215754
[READ], MinLatency(us), 72.0
[READ], MaxLatency(us), 843775.0
[READ], 95thPercentileLatency(us), 75839.0
[READ], 99thPercentileLatency(us), 131711.0
[READ], Return=OK, 1000237
[READ], Return=NOT_FOUND, 1