ycsb_run_t100_r10_u20_i70.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 212787.0
[OVERALL], Throughput(ops/sec), 46995.352159671405
[TOTAL_GCS_PS_Scavenge], Count, 205.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1106.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5197685948859658
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 205.0
[TOTAL_GC_TIME], Time(ms), 1106.0
[TOTAL_GC_TIME_%], Time(%), 0.5197685948859658
[READ-FAILED], Operations, 14.0
[READ-FAILED], AverageLatency(us), 5633.285714285715
[READ-FAILED], MinLatency(us), 120.0
[READ-FAILED], MaxLatency(us), 30063.0
[READ-FAILED], 95thPercentileLatency(us), 20479.0
[READ-FAILED], 99thPercentileLatency(us), 30063.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 52.5
[CLEANUP], MinLatency(us), 1.0
[CLEANUP], MaxLatency(us), 5011.0
[CLEANUP], 95thPercentileLatency(us), 3.0
[CLEANUP], 99thPercentileLatency(us), 16.0
[INSERT], Operations, 7001568.0
[INSERT], AverageLatency(us), 82.1098431094292
[INSERT], MinLatency(us), 15.0
[INSERT], MaxLatency(us), 139775.0
[INSERT], 95thPercentileLatency(us), 93.0
[INSERT], 99thPercentileLatency(us), 450.0
[INSERT], Return=OK, 7001568
[READ], Operations, 999680.0
[READ], AverageLatency(us), 20279.290684018884
[READ], MinLatency(us), 77.0
[READ], MaxLatency(us), 2203647.0
[READ], 95thPercentileLatency(us), 66943.0
[READ], 99thPercentileLatency(us), 119999.0
[READ], Return=OK, 999680
[READ], Return=NOT_FOUND, 14
[UPDATE], Operations, 1998738.0
[UPDATE], AverageLatency(us), 62.3647426526138
[UPDATE], MinLatency(us), 8.0
[UPDATE], MaxLatency(us), 117631.0
[UPDATE], 95thPercentileLatency(us), 66.0
[UPDATE], 99thPercentileLatency(us), 335.0
[UPDATE], Return=OK, 1998738