ycsb_run_t100_r50_u50.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 337878.0
[OVERALL], Throughput(ops/sec), 29596.481570270927
[TOTAL_GCS_PS_Scavenge], Count, 321.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1053.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3116509509349529
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 321.0
[TOTAL_GC_TIME], Time(ms), 1053.0
[TOTAL_GC_TIME_%], Time(%), 0.3116509509349529
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 55.01
[CLEANUP], MinLatency(us), 1.0
[CLEANUP], MaxLatency(us), 5239.0
[CLEANUP], 95thPercentileLatency(us), 4.0
[CLEANUP], 99thPercentileLatency(us), 20.0
[READ], Operations, 4999707.0
[READ], AverageLatency(us), 6654.8808580182795
[READ], MinLatency(us), 65.0
[READ], MaxLatency(us), 2.0725759E7
[READ], 95thPercentileLatency(us), 21999.0
[READ], 99thPercentileLatency(us), 39103.0
[READ], Return=OK, 4999707
[UPDATE], Operations, 5000293.0
[UPDATE], AverageLatency(us), 62.51089386161971
[UPDATE], MinLatency(us), 9.0
[UPDATE], MaxLatency(us), 99967.0
[UPDATE], 95thPercentileLatency(us), 68.0
[UPDATE], 99thPercentileLatency(us), 267.0
[UPDATE], Return=OK, 5000293