ycsb_run_t100_r70_u20_i10.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 195966.0
[OVERALL], Throughput(ops/sec), 51029.260177785945
[TOTAL_GCS_PS_Scavenge], Count, 20.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1332.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6797097455681088
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 20.0
[TOTAL_GC_TIME], Time(ms), 1332.0
[TOTAL_GC_TIME_%], Time(%), 0.6797097455681088
[READ-FAILED], Operations, 6.0
[READ-FAILED], AverageLatency(us), 983.8333333333334
[READ-FAILED], MinLatency(us), 295.0
[READ-FAILED], MaxLatency(us), 2625.0
[READ-FAILED], 95thPercentileLatency(us), 2625.0
[READ-FAILED], 99thPercentileLatency(us), 2625.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 60.36
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 5779.0
[CLEANUP], 95thPercentileLatency(us), 4.0
[CLEANUP], 99thPercentileLatency(us), 25.0
[INSERT], Operations, 1001197.0
[INSERT], AverageLatency(us), 252.44167431584393
[INSERT], MinLatency(us), 21.0
[INSERT], MaxLatency(us), 1.3295615E7
[INSERT], 95thPercentileLatency(us), 108.0
[INSERT], 99thPercentileLatency(us), 783.0
[INSERT], Return=OK, 1001197
[READ], Operations, 6998854.0
[READ], AverageLatency(us), 2647.108107555894
[READ], MinLatency(us), 57.0
[READ], MaxLatency(us), 1.3377535E7
[READ], 95thPercentileLatency(us), 9327.0
[READ], 99thPercentileLatency(us), 18127.0
[READ], Return=OK, 6998854
[READ], Return=NOT_FOUND, 6
[UPDATE], Operations, 1999943.0
[UPDATE], AverageLatency(us), 248.62104869988795
[UPDATE], MinLatency(us), 11.0
[UPDATE], MaxLatency(us), 1.3352959E7
[UPDATE], 95thPercentileLatency(us), 69.0
[UPDATE], 99thPercentileLatency(us), 541.0
[UPDATE], Return=OK, 1999943