ycsb_run_t100_r95_i5.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 88974.0
[OVERALL], Throughput(ops/sec), 112392.38429204037
[TOTAL_GCS_PS_Scavenge], Count, 22.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 576.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6473801335221525
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 22.0
[TOTAL_GC_TIME], Time(ms), 576.0
[TOTAL_GC_TIME_%], Time(%), 0.6473801335221525
[READ-FAILED], Operations, 2.0
[READ-FAILED], AverageLatency(us), 5294.5
[READ-FAILED], MinLatency(us), 545.0
[READ-FAILED], MaxLatency(us), 10047.0
[READ-FAILED], 95thPercentileLatency(us), 10047.0
[READ-FAILED], 99thPercentileLatency(us), 10047.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 62.15
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 6031.0
[CLEANUP], 95thPercentileLatency(us), 3.0
[CLEANUP], 99thPercentileLatency(us), 16.0
[INSERT], Operations, 500221.0
[INSERT], AverageLatency(us), 129.41064849336593
[INSERT], MinLatency(us), 21.0
[INSERT], MaxLatency(us), 801279.0
[INSERT], 95thPercentileLatency(us), 98.0
[INSERT], 99thPercentileLatency(us), 1176.0
[INSERT], Return=OK, 500221
[READ], Operations, 9499777.0
[READ], AverageLatency(us), 911.6383231943234
[READ], MinLatency(us), 58.0
[READ], MaxLatency(us), 1734655.0
[READ], 95thPercentileLatency(us), 2103.0
[READ], 99thPercentileLatency(us), 7687.0
[READ], Return=OK, 9499777
[READ], Return=NOT_FOUND, 2