ycsb_validation_load_t100.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 115932.0
[OVERALL], Throughput(ops/sec), 86257.46127039989
[TOTAL_GCS_PS_Scavenge], Count, 16.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 294.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2535969361349757
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 16.0
[TOTAL_GC_TIME], Time(ms), 294.0
[TOTAL_GC_TIME_%], Time(%), 0.2535969361349757
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 61.09
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 5907.0
[CLEANUP], 95thPercentileLatency(us), 3.0
[CLEANUP], 99thPercentileLatency(us), 17.0
[INSERT], Operations, 1.0E7
[INSERT], AverageLatency(us), 1086.3897028
[INSERT], MinLatency(us), 11.0
[INSERT], MaxLatency(us), 5414911.0
[INSERT], 95thPercentileLatency(us), 48.0
[INSERT], 99thPercentileLatency(us), 686.0
[INSERT], Return=OK, 10000000