ycsb_validation_run_t100_r10_i90.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 244206.0
[OVERALL], Throughput(ops/sec), 40949.034831249024
[TOTAL_GCS_PS_Scavenge], Count, 57.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 369.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1511019385273089
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 57.0
[TOTAL_GC_TIME], Time(ms), 369.0
[TOTAL_GC_TIME_%], Time(%), 0.1511019385273089
[READ-FAILED], Operations, 6.0
[READ-FAILED], AverageLatency(us), 3020.0
[READ-FAILED], MinLatency(us), 291.0
[READ-FAILED], MaxLatency(us), 5935.0
[READ-FAILED], 95thPercentileLatency(us), 5935.0
[READ-FAILED], 99thPercentileLatency(us), 5935.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 49.15
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 4743.0
[CLEANUP], 95thPercentileLatency(us), 2.0
[CLEANUP], 99thPercentileLatency(us), 18.0
[INSERT], Operations, 8999992.0
[INSERT], AverageLatency(us), 50.644348350531864
[INSERT], MinLatency(us), 14.0
[INSERT], MaxLatency(us), 143359.0
[INSERT], 95thPercentileLatency(us), 50.0
[INSERT], 99thPercentileLatency(us), 183.0
[INSERT], Return=OK, 8999992
[READ], Operations, 1000002.0
[READ], AverageLatency(us), 23709.003255993488
[READ], MinLatency(us), 73.0
[READ], MaxLatency(us), 874495.0
[READ], 95thPercentileLatency(us), 74495.0
[READ], 99thPercentileLatency(us), 127231.0
[READ], Return=OK, 1000002
[READ], Return=NOT_FOUND, 6