ycsb_validation_run_t100_r10_u20_i70.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 211929.0
[OVERALL], Throughput(ops/sec), 47185.61404998844
[TOTAL_GCS_PS_Scavenge], Count, 198.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1004.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4737435650618839
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 198.0
[TOTAL_GC_TIME], Time(ms), 1004.0
[TOTAL_GC_TIME_%], Time(%), 0.4737435650618839
[READ-FAILED], Operations, 22.0
[READ-FAILED], AverageLatency(us), 12304.363636363636
[READ-FAILED], MinLatency(us), 223.0
[READ-FAILED], MaxLatency(us), 52319.0
[READ-FAILED], 95thPercentileLatency(us), 46623.0
[READ-FAILED], 99thPercentileLatency(us), 52319.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 61.43
[CLEANUP], MinLatency(us), 1.0
[CLEANUP], MaxLatency(us), 5939.0
[CLEANUP], 95thPercentileLatency(us), 3.0
[CLEANUP], 99thPercentileLatency(us), 16.0
[INSERT], Operations, 7001689.0
[INSERT], AverageLatency(us), 81.66241673973236
[INSERT], MinLatency(us), 15.0
[INSERT], MaxLatency(us), 143359.0
[INSERT], 95thPercentileLatency(us), 93.0
[INSERT], 99thPercentileLatency(us), 449.0
[INSERT], Return=OK, 7001689
[READ], Operations, 999418.0
[READ], AverageLatency(us), 20223.295329881992
[READ], MinLatency(us), 75.0
[READ], MaxLatency(us), 879103.0
[READ], 95thPercentileLatency(us), 67327.0
[READ], 99thPercentileLatency(us), 118015.0
[READ], Return=OK, 999418
[READ], Return=NOT_FOUND, 22
[UPDATE], Operations, 1998871.0
[UPDATE], AverageLatency(us), 59.5288535378221
[UPDATE], MinLatency(us), 8.0
[UPDATE], MaxLatency(us), 201727.0
[UPDATE], 95thPercentileLatency(us), 65.0
[UPDATE], 99thPercentileLatency(us), 330.0
[UPDATE], Return=OK, 1998871