ycsb_validation_run_t100_r50_u50.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 347989.0
[OVERALL], Throughput(ops/sec), 28736.54052283262
[TOTAL_GCS_PS_Scavenge], Count, 468.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1523.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.43765751216274074
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 468.0
[TOTAL_GC_TIME], Time(ms), 1523.0
[TOTAL_GC_TIME_%], Time(%), 0.43765751216274074
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 53.22
[CLEANUP], MinLatency(us), 1.0
[CLEANUP], MaxLatency(us), 5027.0
[CLEANUP], 95thPercentileLatency(us), 4.0
[CLEANUP], 99thPercentileLatency(us), 26.0
[READ], Operations, 5000582.0
[READ], AverageLatency(us), 6861.01072835122
[READ], MinLatency(us), 63.0
[READ], MaxLatency(us), 3.5356671E7
[READ], 95thPercentileLatency(us), 21935.0
[READ], 99thPercentileLatency(us), 38751.0
[READ], Return=OK, 5000582
[UPDATE], Operations, 4999418.0
[UPDATE], AverageLatency(us), 65.22678019721495
[UPDATE], MinLatency(us), 10.0
[UPDATE], MaxLatency(us), 116863.0
[UPDATE], 95thPercentileLatency(us), 69.0
[UPDATE], 99thPercentileLatency(us), 271.0
[UPDATE], Return=OK, 4999418